<template>
    <div style="width: 1170px; margin: 0 auto;">
        <div style="width: 100%; height: 100px; line-height: 100px; text-align: center; display: inline-block;">
            <h1>洋盘&nbsp;• 隐私政策</h1>
        </div>
        <br>
        <br>
        <hr>
        <br>
        <br>
    <h2>引言</h2>
    <p>本隐私政策解释了我们（以下称为“我们”或“服务提供商”）收集、使用、披露和处理用户（以下称为“您”或“用户”）的个人信息的方式。请仔细阅读本隐私政策，以了解我们如何保护您的个人信息。</p>
    
    <h2>信息收集</h2>
    
        <p>我们可能会收集以下类型的个人信息：</p>
        <ul>
            <li>帐户信息：当您注册或使用我们的云盘服务时，我们可能会要求您提供个人身份信息，例如您的姓名、电子邮件地址和密码。这些信息将用于创建和管理您的帐户，并确保您能够安全地访问我们的服务。</li>
            <li>文件和数据：您可以选择将文件和其他数据存储在我们的云盘中。这些文件和数据属于您个人，并且只有在您授权的情况下才会被共享或披露。</li>
            <li>日志信息：当您使用我们的服务时，我们的系统可能会自动收集与您的使用方式相关的信息，包括您的IP地址、浏览器类型、访问时间和日期以及与您的使用相关的统计信息。这些信息帮助我们改进服务并提供更好的用户体验。</li>
        </ul>
    <h2>使用的信息</h2>
    
    <p>我们可能会使用您的个人信息来：</p>
    <ul>
        <li>- 向您发送有关我们的产品和服务的信息；</li>
        <li>- 改善我们的产品和服务；</li>
        <li>- 管理我们的网站和应用程序；</li>
        <li>- 处理您的请求和反馈；</li>
        <li>- 遵守适用的法律法规。</li>
    </ul>
    <h2> 信息保护</h2>
    
    <p>我们非常重视保护您的个人信息安全。我们采取合理的技术和组织措施来保护您的信息免受未经授权的访问、使用或披露。我们使用加密技术来保护您的文件和数据，并限制对您的个人信息的访问权限。</p>
    
    <h2> 信息共享</h2>
    
    <p>我们不会向第三方出售、出租或共享您的个人信息，除非：</p>
    <ul>
        <li>- 您明确同意共享；</li>
        <li>- 我们需要与供应商、承包商或代理商共享您的信息，以便为您提供服务；</li>
        <li>- 我们需要遵守适用的法律法规或法院命令。</li>
    </ul>
    <h2>Cookie</h2>
    
    <p>我们的网站和服务可能使用Cookie和类似的跟踪技术来提供更好的用户体验和功能。Cookie是一种包含小量数据的文本文件，存储在您的计算机或设备上。您可以根据自己的偏好设置浏览器，拒绝所有或某些Cookie。请注意，如果禁用Cookie，可能会影响您对我们服务的使用体验。</p>
    <h2>未成年人隐私</h2>
    
    <p>我们不会故意收集未满 18 岁的儿童的个人信息。如果您是未成年人，请不要向我们提供任何个人信息。</p>
    
    <h2> 隐私政策的更新</h2>
    
    <p>我们可能会不时更新本隐私政策。更新后的隐私政策将在我们的网站上发布，并在生效之前通知您。请定期查看我们的隐私政策，以了解我们如何保护您的个人信息。</p>
    
    <h2> 联系我们</h2>
    
    <p>如果您对我们的隐私政策有任何疑问或意见，请通过我们的网站上提供的联系方式与我们联系。<br>感谢您对我们服务的信任和使用！</p>
    </div>
    <div style="text-align: right; color: grey; margin-top: 30px;">更新日期：2024年01月05日</div>
    <hr>
    <div style="text-align: center; font-size: 11px; color: #666; margin: 20px 0 20px 0;">
        <p>
                                地址：四川省成都市双流区西航港街道成都信息工程大学 邮编：610225 电话：028-85966502  邮箱: yangpang@stu.cuit.edu.cn 
            <br> 
               蜀ICP备05006389号-1川公网安备51012202000991号 团队：1班3组
        </p>
    </div>
</template>
<style scoped>
    h2 {
            margin-left: 10px;
        }
        p {
            margin-left: 20px;
        }
        hr {
            color: #eee;
            width: 1170px;
            margin-top: 30px;
        }
</style>